"""
Скрипт для получения списка складов WB и их ID.
"""
import sqlite3
import sys
from pathlib import Path

# Путь к БД напрямую
DATABASE_PATH = "bot_data.db"


def get_warehouses_from_db():
    """Получить список складов из БД (если они там сохранены)"""
    conn = sqlite3.connect(DATABASE_PATH)
    cursor = conn.cursor()

    # Проверяем есть ли таблица warehouses
    cursor.execute("""
        SELECT name FROM sqlite_master
        WHERE type='table' AND name='warehouses'
    """)

    if cursor.fetchone():
        cursor.execute("SELECT * FROM warehouses LIMIT 10")
        rows = cursor.fetchall()
        if rows:
            print("Склады из БД:")
            print("-" * 80)
            for row in rows:
                print(row)
            print("-" * 80)
    else:
        print("Таблица warehouses не найдена в БД")

    conn.close()


def get_common_warehouse_ids():
    """Вывести часто используемые ID складов"""
    print("\n" + "=" * 80)
    print("ЧАСТО ИСПОЛЬЗУЕМЫЕ СКЛАДЫ WILDBERRIES")
    print("=" * 80)

    common_warehouses = {
        "Коледино": 507,
        "Подольск": 117501,
        "Электросталь": 1733,
        "Казань": 120762,
        "Краснодар": 130744,
        "Екатеринбург": 121709,
        "Санкт-Петербург": 117986,
        "Новосибирск": 686,
        "Тюмень": 1193,
        "Белая Дача (Котовск)": 658434,
        # Рязань может иметь разные ID в зависимости от конкретного склада
    }

    print("\nОсновные склады:")
    for name, wh_id in common_warehouses.items():
        print(f"  {name}: {wh_id}")

    print("\n" + "=" * 80)
    print("⚠️  ВНИМАНИЕ: ID складов могут отличаться!")
    print("Для точного определения используйте:")
    print("  1. ЛК Wildberries → Перераспределение → посмотрите в выпадающем списке")
    print("  2. WB API /api/v3/offices")
    print("=" * 80)


def search_warehouse(name: str):
    """Поиск склада по названию"""
    # Для Рязани попробуем найти варианты
    if "рязань" in name.lower() or "тюшевское" in name.lower():
        print(f"\n🔍 Поиск склада: {name}")
        print("-" * 80)
        print("Рязань (Тюшевское) - возможные варианты:")
        print("  - Рязань (Тюшевское): ID может быть 130744, 300571 или другой")
        print("  - Проверьте в ЛК WB или через API")
        print("-" * 80)


if __name__ == "__main__":
    print("=" * 80)
    print("ПОИСК ID СКЛАДОВ WILDBERRIES")
    print("=" * 80)

    # Пробуем найти в БД
    print("\n1. Проверка базы данных...")
    get_warehouses_from_db()

    # Показываем общий список
    get_common_warehouse_ids()

    # Ищем Рязань
    search_warehouse("Рязань Тюшевское")

    print("\n" + "=" * 80)
    print("РЕКОМЕНДАЦИЯ:")
    print("=" * 80)
    print("Для ваших данных (Рязань → Краснодар) попробуйте:")
    print()
    print("python test_redistribution.py \\")
    print("  --phone +79956316615 \\")
    print("  --nm-id 246490100 \\")
    print("  --from-warehouse 300571 \\  # Рязань (попробуйте разные ID)")
    print("  --to-warehouse 130744 \\    # Краснодар")
    print("  --quantity 1 \\")
    print("  --visible")
    print()
    print("Если ID неправильный - бот скажет об этом, и можно попробовать другой.")
    print("=" * 80)
